src/Catalogs/Web1C_Компоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Web1C_Компоненты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИсточникаДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Web1C_ВидыИсточниковДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Список</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВходящиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/Web1C_ВидыИсточниковДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>Web1C_ВидыИсточниковДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Список</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСОбработкойРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйКод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/Web1C_ВидыРесурса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>Web1C_ВидыРесурса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Стиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скрипт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Web1C_ИсточникДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Web1C_ИсточникДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Web1C_Компоненты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоставПриАктивизацииСтроки(Элемент)
	СтрокаТЧ = Элементы.Состав.ТекущаяСтрока;
	Если СтрокаТЧ = Неопределено Или СтрокаТЧ = ИДСтрокиСостава Тогда
		Возврат;
	КонецЕсли;
	
	ИДСтрокиСостава = СтрокаТЧ;
	
	ОчиститьДанныеКонструктора();
	
	ПрочитатьСтрокуСоставаНаСервере(СтрокаТЧ);
	
	УстановитьВидимостьКонструктора();
	
	ОтметкаМодифицированностиЭлементаСостава(Ложь);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСтрокуСоставаНаСервере(ИДСтроки)
	ТекОб = РеквизитФормыВЗначение("Объект");
	СтрокаТЧ = ТекОб.Состав.Получить(ИДСтроки);
	
	НаименованиеЭлементаСостава = СтрокаТЧ.Наименование;
	Текст = СтрокаТЧ.Текст;
	ВидИсточникаДанных = СтрокаТЧ.ВидИсточникаДанных;
	ИсточникДанных = СтрокаТЧ.ИсточникДанных;
	
	Если Не ПустаяСтрока(СтрокаТЧ.Параметры) Тогда
		ПараметрыСТроки = ЗначениеИзСтрокиВнутр(СтрокаТЧ.Параметры);
		Если ПараметрыСТроки <> Неопределено Тогда
			ПараметрыИсточника.Загрузить(ПараметрыСТроки.ПараметрыИсточника);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПараметрыИсточникаПараметр.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокПараметровИсточника().ВыгрузитьЗначения());
	
	Если ЗначениеЗаполнено(ИсточникДанных) Тогда
		СписокПолейИсточника = ПолучитьСписокПолейИсточника();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТекОб, "Объект");
КонецПроцедуры


&НаКлиенте
Процедура СохранитьЭлементСостава(Команда)
	СтрокаТЧ = Элементы.Состав.ТекущаяСтрока;
	Если СтрокаТЧ = Неопределено И СтрокаТЧ = ИДСтрокиСостава Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьСтрокуСостава();
	
	ОтметкаМодифицированностиЭлементаСостава(Ложь);
	//СтрокаТЧ.Наименование = НаименованиеЭлементаСостава;
	//СтрокаТЧ.Текст = Текст;
	//СтрокаТЧ.ВидИсточникаДанных = ВидИсточникаДанных;
	//
	//ПараметрыСтроки = Новый Структура;
	////ПараметрыСтроки.Вставить("ПараметрыИсточника", ПараметрыИсточника.Выгрузить());
	//ПараметрыСтроки.Вставить("ПараметрыИсточника", ПараметрыИсточника);
	//СтрокаТЧ.Параметры = ПолучитьИзВременногоХранилища(ПолучитьХранилище(ПараметрыСтроки));
КонецПроцедуры

&НаСервере
Процедура СохранитьСтрокуСостава()
	ТекОб = РеквизитФормыВЗначение("Объект");
	СтрокаТЧ = ТекОб.Состав.Получить(ИДСтрокиСостава);
	
	СтрокаТЧ.Наименование = НаименованиеЭлементаСостава;
	СтрокаТЧ.Текст = Текст;
	СтрокаТЧ.ВидИсточникаДанных = ВидИсточникаДанных;
	СтрокаТЧ.ИсточникДанных = ИсточникДанных;
	
	ПараметрыСтроки = Новый Структура;
	ПараметрыСтроки.Вставить("ПараметрыИсточника", ПараметрыИсточника.Выгрузить());
	//ПараметрыСтроки.Вставить("ПараметрыИсточника", ПараметрыИсточника);
	СтрокаТЧ.Параметры = ЗначениеВСтрокуВнутр(ПараметрыСтроки);
	
	ЗначениеВРеквизитФормы(ТекОб, "Объект");
	Записать();
КонецПроцедуры


&НаСервере
Функция ПолучитьХранилище(Данные)
	Результат = Новый ХранилищеЗначения(Данные);
	
	Возврат ПоместитьВоВременноеХранилище(Результат);
КонецФункции

&НаКлиенте
Процедура ПараметрыИсточникаПриАктивизацииСтроки(Элемент)
	НастроитьСтрокуПараметраИсточника();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСтрокуПараметраИсточника()
	ТекСтрока = Элементы.ПараметрыИсточника.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.ИсточникЗначения = 0 Тогда
		Элементы.ПараметрыИсточникаЗначение.РежимВыбораИзСписка = Ложь;
		Элементы.ПараметрыИсточникаЗначение.РедактированиеТекста = Истина;
		
		ПривестиТипПоля(ТекСтрока.Параметр);
	Иначе
		Элементы.ПараметрыИсточникаЗначение.РежимВыбораИзСписка = Истина;
		Элементы.ПараметрыИсточникаЗначение.РедактированиеТекста = Ложь;
		//Элементы.ПараметрыИсточникаЗначение.СписокВыбора = ПолучитьСписокВходящихПараметров();
		Элементы.ПараметрыИсточникаЗначение.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокВходящихПараметров().ВыгрузитьЗначения());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПривестиТипПоля(Параметр)
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКонструктора(ПриводитьТип = Ложь)
	Если ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Запрос") Тогда
		Элементы.ПараметрыИсточника.Видимость = Истина;
		Элементы.ИсточникДанных.Видимость = Истина;
		Элементы.ПодсказкаКод.Видимость = Ложь;
		Если ПриводитьТип Тогда
			ИсточникДанных = ПредопределенноеЗначение("Справочник.Web1C_ИсточникДанных.ПустаяСсылка");
		КонецЕсли;
	ИначеЕсли ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ПростойТекст") Тогда
		Элементы.ПараметрыИсточника.Видимость = Ложь;
		Элементы.ИсточникДанных.Видимость = Ложь;
		Элементы.ПодсказкаКод.Видимость = Ложь;
		Если ПриводитьТип Тогда
			ИсточникДанных = Неопределено;
		КонецЕсли;
	ИначеЕсли ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Значение") Тогда
	    Элементы.ПараметрыИсточника.Видимость = Ложь;
		Элементы.ИсточникДанных.Видимость = Ложь;
		Элементы.ПодсказкаКод.Видимость = Ложь;
		Если ПриводитьТип Тогда
			ИсточникДанных = Неопределено;
		КонецЕсли;
	ИначеЕсли ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Объект") Тогда
		Элементы.ПараметрыИсточника.Видимость = Ложь;
		Элементы.ИсточникДанных.Видимость = Истина;
		Элементы.ПодсказкаКод.Видимость = Ложь;
		Если ПриводитьТип Тогда
			ИсточникДанных = Неопределено;
		КонецЕсли;
	ИначеЕсли ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Список") Тогда
		Элементы.ПараметрыИсточника.Видимость = Ложь;
		Элементы.ИсточникДанных.Видимость = Ложь;
		Элементы.ПодсказкаКод.Видимость = Ложь;
		Если ПриводитьТип Тогда
			ИсточникДанных = Новый СписокЗначений;
		КонецЕсли;
	ИначеЕсли ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ЗапросСОбработкойРезультата") Тогда
		Элементы.ПараметрыИсточника.Видимость = Истина;
		Элементы.ИсточникДанных.Видимость = Истина;
		Элементы.ПодсказкаКод.Видимость = Истина;
		Если ПриводитьТип Тогда
			ИсточникДанных = ПредопределенноеЗначение("Справочник.Web1C_ИсточникДанных.ПустаяСсылка");
		КонецЕсли;
	ИначеЕсли ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ПроизвольныйКод") Тогда
		Элементы.ПараметрыИсточника.Видимость = Ложь;
		Элементы.ИсточникДанных.Видимость = Ложь;
		Элементы.ПодсказкаКод.Видимость = Истина;
		Если ПриводитьТип Тогда
			ИсточникДанных = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокВходящихПараметров()
	Результат = Новый  СписокЗначений;
	
	Для каждого вхПараметр Из Объект.ВходящиеПараметры Цикл
		Результат.Добавить(вхПараметр.ИмяПараметра);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьСписокПараметровИсточника()
	Результат = Новый СписокЗначений;
	
	Если ВидИсточникаДанных <> ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Запрос") И ВидИсточникаДанных <> ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ЗапросСОбработкойРезультата") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсточникДанныхПараметры.Параметр КАК Параметр
	|ИЗ
	|	Справочник.Web1C_ИсточникДанных.Параметры КАК ИсточникДанныхПараметры
	|ГДЕ
	|	ИсточникДанныхПараметры.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ИсточникДанных);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Параметр);
	КонецЦикла; 
	
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьСписокПолейИсточника()
	Результат = Новый СписокЗначений;
	
	Если ВидИсточникаДанных <> ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Запрос") И ВидИсточникаДанных <> ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ЗапросСОбработкойРезультата") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсточникДанныхПоля.ИмяПоля КАК ИмяПоля,
	|	ИсточникДанныхПоля.Формат КАК Формат
	|ИЗ
	|	Справочник.Web1C_ИсточникДанных.Поля КАК ИсточникДанныхПоля
	|ГДЕ
	|	ИсточникДанныхПоля.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ИсточникДанных);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Запрос") Тогда
			Результат.Добавить("{#Поле_" + Выборка.ИмяПоля + "#}", Выборка.ИмяПоля);
		ИначеЕсли ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ЗапросСОбработкойРезультата") Тогда
			Результат.Добавить("ВыборкаДанных." + Выборка.ИмяПоля, Выборка.ИмяПоля);
			Если Не ПустаяСтрока(Выборка.Формат) Тогда
				Результат.Добавить("Формат(ВыборкаДанных." + Выборка.ИмяПоля + ", """ + Выборка.Формат + """)", Выборка.ИмяПоля + " - формат поля");
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла; 
	
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПараметрыИсточникаИсточникЗначенияПриИзменении(Элемент)
	НастроитьСтрокуПараметраИсточника();
КонецПроцедуры

&НаКлиенте
Процедура ВидИсточникаДанныхПриИзменении(Элемент)
	УстановитьВидимостьКонструктора(Истина);
	
	ОтметкаМодифицированностиЭлементаСостава();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	Элементы.ПараметрыИсточникаПараметр.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокПараметровИсточника().ВыгрузитьЗначения());	
	
	СписокПолейИсточника = ПолучитьСписокПолейИсточника();
	
	ОтметкаМодифицированностиЭлементаСостава();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеКонструктора()
	НаименованиеЭлементаСостава = "";
	ВидИсточникаДанных = Неопределено;
	ИсточникДанных = Неопределено;
	ПараметрыИсточника.Очистить();
	Текст = "";
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИДСтрокиСостава = -1;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПолеИсточника(Команда)
	ОО = Новый ОписаниеОповещения("ПослеВыбораПоляИсточника", ЭтотОбъект);
	СписокПолейИсточника.ПоказатьВыборЭлемента(ОО, "Выберите поле", Элементы.ДобавитьПолеИсточника);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПоляИсточника(РезультатВыбора, ДопПараметры) Экспорт 
	Если РезультатВыбора <> Неопределено Тогда
		//Если ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.ВидыИсточниковДанных.Запрос") Тогда
		//	Элементы.Текст.ВыделенныйТекст = "{#Поле_" + РезультатВыбора.Значение + "#}";
		//ИначеЕсли ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.ВидыИсточниковДанных.ЗапросСОбработкойРезультата") Тогда
		//	Элементы.Текст.ВыделенныйТекст = "ВыборкаДанных." + РезультатВыбора.Значение;
		//КонецЕсли;
		Элементы.Текст.ВыделенныйТекст = РезультатВыбора.Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПерменную(Команда)
	СписокПеременных = ПолучитьСписокПеременных();
	
	ОО = Новый ОписаниеОповещения("ПослеВыбораПеременной", ЭтотОбъект);
	СписокПеременных.ПоказатьВыборЭлемента(ОО, "Выберите переменную");
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПеременной(РезультатВыбора, ДопПараметры) Экспорт 
	Если РезультатВыбора <> Неопределено Тогда
		Если ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ЗапросСОбработкойРезультата") Или ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ПроизвольныйКод") Тогда
			Элементы.Текст.ВыделенныйТекст = РезультатВыбора.Значение;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокПеременных()
	Результат = Новый СписокЗначений;
	
	Результат.Добавить("ВыходнаяСтрока");
	Результат.Добавить("НомерСтроки");
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОтметкаМодифицированностиЭлементаСостава(Изменено = Истина)
	Если Изменено Тогда
		Элементы.СохранитьЭлементСостава.ЦветФона = WebЦвета.БледноЗеленый;
	иначе
		Элементы.СохранитьЭлементСостава.ЦветФона = WebЦвета.Белый;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПриИзменении(Элемент)
	ОтметкаМодифицированностиЭлементаСостава();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеЭлементаСоставаПриИзменении(Элемент)
	ОтметкаМодифицированностиЭлементаСостава();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыИсточникаПриИзменении(Элемент)
	ОтметкаМодифицированностиЭлементаСостава();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьКонструктора();
КонецПроцедуры

&НаСервере
Процедура СкопироватьСтрокуСоставаНаСервере(ИДСтроки)
	ТекОб = РеквизитФормыВЗначение("Объект");
	СтрокаТЧ = ТекОб.Состав.Получить(ИДСтроки);
	
	НоваяСтрока = ТекОб.Состав.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	
	ИДСтроки = ТекОб.Состав.Индекс(НоваяСтрока);
	
	ЗначениеВРеквизитФормы(ТекОб, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтрокуСостава(Команда)
	СтрокаТЧ = Элементы.Состав.ТекущаяСтрока;
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СкопироватьСтрокуСоставаНаСервере(СтрокаТЧ);
	
	Элементы.Состав.ТекущаяСтрока = СтрокаТЧ
КонецПроцедуры

&НаКлиенте
Процедура ВставитьВходящийПараметр(Команда)
	СписокПараметров = ПолучитьСписокВходящиеПараметров();
	
	ОО = Новый ОписаниеОповещения("ПослеВыбораПараметра", ЭтотОбъект);
	СписокПараметров.ПоказатьВыборЭлемента(ОО, "Выберите входящий параметр");

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПараметра(РезультатВыбора, ДопПараметры) Экспорт 
	Если РезультатВыбора <> Неопределено Тогда
		Если ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ЗапросСОбработкойРезультата") Или ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ПроизвольныйКод") Тогда
			Элементы.Текст.ВыделенныйТекст = "ВходящиеПараметры." + РезультатВыбора.Значение;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокВходящиеПараметров()
	Результат = Новый СписокЗначений;
	
	Для каждого ТекСтрока Из Объект.ВходящиеПараметры Цикл
		Результат.Добавить(ТекСтрока.ИмяПараметра);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПроверитьМакетНаСервере()
	Записать();
	ВходящиеПараметры = Новый Структура;
	
	Для каждого ТекСтрока Из Объект.ВходящиеПараметры Цикл
		ВходящиеПараметры.Вставить(ТекСтрока.ИмяПараметра, ТекСтрока.ЗначениеДляПроверки);
	КонецЦикла;
	
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьТекстМакета(ВходящиеПараметры);
КонецФункции

&НаКлиенте
Процедура ПроверитьМакет(Команда)
	ПоказатьЗначение(, ПроверитьМакетНаСервере());
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСсылки(ВыбранныйЭлемент, ДопПараметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Элементы.Текст.ВыделенныйТекст = ВыбранныйЭлемент.Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСсылку(Команда)
	СписокПеременных = Web1C_ФормированиеОтветов.ПолучитьСписокСсылок();
	
	ОО = Новый ОписаниеОповещения("ПослеВыбораСсылки", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОО, СписокПеременных, Элементы.ВставитьСсылку); 
КонецПроцедуры

&НаКлиенте
Процедура Изображение(Команда)
	ОО = Новый ОписаниеОповещения("ПослеВыбораИзображения", ЭтотОбъект);
	П = Новый Структура;
	П.Вставить("Отбор", Новый Структура("ВидРесурса", ПредопределенноеЗначение("Перечисление.Web1C_ВидыРесурса.Изображение")));
	
	ОткрытьФорму("Справочник.Ресурсы.ФормаВыбора", П, ЭтаФорма, , , , ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция ПослеВыбораИзображения(РезультатВыбора, ДополнительныеПараметры) экспорт
	Если РезультатВыбора <> Неопределено Тогда
		Элементы.Текст.ВыделенныйТекст = Web1C_УправлениеКонтентом.ПолучитьПредставлениеРесурсаНаСервере(РезультатВыбора);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВставитьФайл(Команда)
	ОО = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	П = Новый Структура;
	
	ОткрытьФорму("Справочник.Ресурсы.ФормаВыбора", П, ЭтаФорма, , , , ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция ПослеВыбораФайла(РезультатВыбора, ДополнительныеПараметры) экспорт
	Если РезультатВыбора <> Неопределено Тогда
		Элементы.Текст.ВыделенныйТекст = Web1C_УправлениеКонтентом.ПолучитьПредставлениеРесурсаНаСервере(РезультатВыбора);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВставитьОбщуюПеременную(Команда)
	СписокПеременных = Web1C_ФормированиеОтветов.ПолучитьСписокПеременных();
	
	ОО = Новый ОписаниеОповещения("ПослеВыбораОбщейПеременной", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОО, СписокПеременных, Элементы.ВставитьОбщуюПеременную);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОбщейПеременной(ВыбранныйЭлемент, ДопПараметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Элементы.Текст.ВыделенныйТекст = ВыбранныйЭлемент.Значение;
	КонецЕсли;
КонецПроцедуры
